//  Lesson-19 Changing a variable

/* 
    Слово "переменная" говорит о том, что ее можно менять. И действительно, с течением времени внутри программы значения переменных могут изменяться.

    let greeting = 'Father!';
    console.log(greeting);
    console.log(greeting);

    greeting = 'Mother!';
    console.log(greeting);
    console.log(greeting);

    Имя осталось тем же, но внутри другие данные. Обратите внимание на ключевое различие между объявлением переменной и ее изменением. 
    Ключевое слово let ставится только при создании переменной, но при изменении оно уже не используется.
*/

//  Задание - Создайте переменную name со значением 'Brienna'.Переопределите значение переменной и присвойте ей ту же строку, но в обратном виде.

let name = 'Brienna';
name = 'anneirB';
console.log(name);
