//  Lesson-19 Choosing a variable name

/* 
    Представим себе, что программа из прошлого урока выглядит так:

    let x = 'Father!';
    console.log(x);
    console.log(x);

    Она по прежнему работает, но в ней изменилось имя переменной на x. Компьютеру без разницы, как мы называем переменные, это бездушная машина, но вот программистам — нет. 
    Мы гораздо чаще читаем код, чем пишем. Причём не свой, а написанный другими людьми. От качества и понятности имён переменных зависит половина успеха в анализе кода.

    Лучше посидеть и придумать название, которое описывает суть, смысл переменной, чем назвать её как попало, а в будущем переделывать. 
    Постарайтесь давать им такие имена, чтобы они были максимально понятны без контекста, без изучения окружающего кода.
    Существует общепринятое правило: не используйте транслит для имён, только английский язык. Если вы испытываете сложности с английским, то пользуйтесь переводчиком. 
    Со временем, копаясь в чужом коде, вы сформируете правильные понятия для именования.
*/

//  Задание - Создайте переменную myBrothersCount, и присвойте ей значение 2. Распечатайте содержимое переменной.

let myBrothersCount = 2;
console.log(myBrothersCount);
