//  Lesson-8 Commutative operation

/*
    «От перемены мест слагаемых сумма не меняется» - один из базовых и интуитивно понятных законов арифметики, называется коммутативным законом.
    Бинарная операция считается коммутативной, если поменяв местами операнды, вы получаете тот же самый результат. Очевидно, что сложение - коммутативная операция: 3 + 2 = 2 + 3.
    А вот является ли коммутативной операция вычитания? Конечно, нет: 2 - 3 ≠ 3 - 2. В программировании этот закон работает точно так же, как в арифметике.
*/

//  Задание - Напишите программу, которая считает и выводит последовательно на экран значения следующих математических выражений: 
//  «3 в степени 5» и «-8 разделить на -4».

console.log(3 ** 5);
console.log(-8 / -4);
