// Lesson-6 Arithmetic operations

// * — умножение
// / — деление
// - — вычитание
// % — остаток от деления
// ** — возведение в степень

// Деление на ноль — это Infinity
// Всегда отбивай арифметические операторы пробелами от операндов – это хороший стиль программирования.
// Не забывай точку с запятой в конце, так как каждая строчка в коде - инструкция.
// Инструкция 2 + 2; заставит компьютер сложить числа и узнать результат. 
// Если запустить эту программу, то ничего не произойдет. А если быть точными, то компьютер вычислит сумму, но на этом всё. 
// Сначала вычисляется сумма, затем она передается в функцию печати. Для этого используется console.log()
console.log(81 / 9);

