//  Lesson-3 Statements

/*
    Инструкция — это команда для компьютера выполнить что-то. Код на JavaScript — это набор инструкций, которые, как правило, отделяются друг от друга символом ;
    Ниже пример кода с двумя инструкциями

    console.log('Mother of Dragons.');
    console.log('Dracarys!');

    Теоретически, инструкции можно написать друг за другом без переноса на новую строчку:

    console.log('Mother of Dragons.'); console.log('Drakarys!');

    Результат на экране будет таким же, но такой код неудобен для чтения, поэтому инструкции располагают друг под другом.
    Так-же можно воспользоваться и иным способом, указанном в примере ниже. Здесь задействуется \n, который переносит значение на следующую строку.

    console.log('\nRobert\nStannis\nRenly')
*/

//  Задание - Выведите на экран друг за другом три имени: 
//  Robert, Stannis, Renly.

console.log('Robert');
console.log('Stannis');
console.log('Renly');
